app/controllers/word_lists_controller.rb

SELECT "word_lists".* FROM "word_lists"
---
  def index
    @word_lists = WordList.all

INSERT INTO "word_lists" ("foreign_word", "english_word", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["foreign_word", "Va bene!"], ["english_word", "It's all good!"], ["created_at", "2018-11-08 17:54:35.990485"], ["updated_at", "2018-11-08 17:54:35.990485"]]
---
  def create
    @word_list = WordList.create!(word_list_params)

UPDATE "word_lists" SET "foreign_word" = $1, "english_word" = $2, "updated_at" = $3 WHERE "word_lists"."id" = $4  [["foreign_word", "Va bene!"], ["english_word", "It's all good!"], ["updated_at", "2018-11-08 18:10:15.086192"], ["id", 5]]
---
  def update
    @word_list.update(word_list_params)

DELETE FROM "word_lists" WHERE "word_lists"."id" = $1  [["id", 7]]
---
  def destroy
    @word_list.destroy

SELECT  "word_lists".* FROM "word_lists" WHERE "word_lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_word_list
    @word_list = WordList.find(params[:id])